; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image0 - mode
	thermograph7 - mode
	spectrograph4 - mode
	image5 - mode
	thermograph6 - mode
	infrared2 - mode
	spectrograph3 - mode
	image8 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image8)
	(supports instrument0 image1)
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph6)
	(supports instrument0 image5)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph7)
	(supports instrument0 image0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(have_image Star7 image5)
	(have_image Phenomenon8 spectrograph4)
	(have_image Phenomenon8 thermograph7)
	(have_image Star9 thermograph6)
	(have_image Star9 thermograph7)
	(have_image Star10 infrared2)
	(have_image Star10 image5)
	(have_image Star10 image8)
	(have_image Phenomenon11 infrared2)
	(have_image Phenomenon11 thermograph7)
	(have_image Planet12 image8)
	(have_image Planet12 image5)
	(have_image Planet12 thermograph7)
))

)

; plan
1. (turn_to satellite0 star4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star4)
   goals met: 0 of 13
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 13
3. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 13
4. (turn_to satellite0 star9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star9)
   goals met: 0 of 13
5. (take_image satellite0 star9 instrument0 thermograph7)
   added: (have_image star9 thermograph7)
   goals met: 1 of 13
6. (take_image satellite0 star9 instrument0 thermograph6)
   added: (have_image star9 thermograph6)
   goals met: 2 of 13
7. (turn_to satellite0 star7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star7)
   goals met: 2 of 13
8. (take_image satellite0 star7 instrument0 image5)
   added: (have_image star7 image5)
   goals met: 3 of 13
9. (turn_to satellite0 phenomenon8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 13
10. (take_image satellite0 phenomenon8 instrument0 thermograph7)
   added: (have_image phenomenon8 thermograph7)
   goals met: 4 of 13
11. (take_image satellite0 phenomenon8 instrument0 spectrograph4)
   added: (have_image phenomenon8 spectrograph4)
   goals met: 5 of 13
12. (turn_to satellite0 phenomenon11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 13
13. (take_image satellite0 phenomenon11 instrument0 thermograph7)
   added: (have_image phenomenon11 thermograph7)
   goals met: 6 of 13
14. (take_image satellite0 phenomenon11 instrument0 infrared2)
   added: (have_image phenomenon11 infrared2)
   goals met: 7 of 13
15. (turn_to satellite0 planet12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet12)
   goals met: 7 of 13
16. (take_image satellite0 planet12 instrument0 image5)
   added: (have_image planet12 image5)
   goals met: 8 of 13
17. (take_image satellite0 planet12 instrument0 image8)
   added: (have_image planet12 image8)
   goals met: 9 of 13
18. (take_image satellite0 planet12 instrument0 thermograph7)
   added: (have_image planet12 thermograph7)
   goals met: 10 of 13
19. (turn_to satellite0 star10 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star10)
   goals met: 10 of 13
20. (take_image satellite0 star10 instrument0 image5)
   added: (have_image star10 image5)
   goals met: 11 of 13
21. (take_image satellite0 star10 instrument0 image8)
   added: (have_image star10 image8)
   goals met: 12 of 13
22. (take_image satellite0 star10 instrument0 infrared2)
   added: (have_image star10 infrared2)
   goals met: 13 of 13
